; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-6-5-41)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	package24 - package
	package25 - package
	package26 - package
	package27 - package
	package28 - package
	package29 - package
	package30 - package
	package31 - package
	package32 - package
	package33 - package
	package34 - package
	package35 - package
	package36 - package
	package37 - package
	package38 - package
	package39 - package
	package40 - package
	package41 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p0-2 - location
	p1-0 - location
	p1-3 - location
	p1-4 - location
	p2-1 - location
	p4-3 - location
	)
	(:init
	(at driver1 s4)
	(at driver2 s2)
	(at driver3 s0)
	(at driver4 s1)
	(at driver5 s1)
	(at driver6 s2)
	(at truck1 s3)
	(empty truck1)
	(at truck2 s4)
	(empty truck2)
	(at truck3 s2)
	(empty truck3)
	(at truck4 s2)
	(empty truck4)
	(at truck5 s4)
	(empty truck5)
	(at package1 s2)
	(at package2 s0)
	(at package3 s3)
	(at package4 s2)
	(at package5 s0)
	(at package6 s3)
	(at package7 s4)
	(at package8 s3)
	(at package9 s0)
	(at package10 s3)
	(at package11 s4)
	(at package12 s3)
	(at package13 s4)
	(at package14 s1)
	(at package15 s0)
	(at package16 s3)
	(at package17 s0)
	(at package18 s0)
	(at package19 s4)
	(at package20 s0)
	(at package21 s0)
	(at package22 s0)
	(at package23 s1)
	(at package24 s4)
	(at package25 s0)
	(at package26 s3)
	(at package27 s1)
	(at package28 s4)
	(at package29 s0)
	(at package30 s1)
	(at package31 s1)
	(at package32 s4)
	(at package33 s4)
	(at package34 s4)
	(at package35 s2)
	(at package36 s4)
	(at package37 s1)
	(at package38 s0)
	(at package39 s2)
	(at package40 s0)
	(at package41 s2)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(link s0 s1)
	(link s1 s0)
	(link s0 s4)
	(link s4 s0)
	(link s2 s1)
	(link s1 s2)
	(link s2 s4)
	(link s4 s2)
	(link s3 s0)
	(link s0 s3)
	(link s3 s2)
	(link s2 s3)
	(link s4 s3)
	(link s3 s4)
)
	(:goal (and
	(at driver1 s2)
	(at driver2 s3)
	(at driver3 s1)
	(at driver4 s0)
	(at driver5 s2)
	(at driver6 s3)
	(at truck2 s3)
	(at truck3 s3)
	(at truck4 s3)
	(at package1 s4)
	(at package2 s0)
	(at package3 s2)
	(at package4 s3)
	(at package5 s1)
	(at package6 s0)
	(at package7 s0)
	(at package8 s2)
	(at package9 s4)
	(at package10 s4)
	(at package11 s2)
	(at package12 s2)
	(at package13 s0)
	(at package14 s2)
	(at package15 s3)
	(at package16 s1)
	(at package17 s0)
	(at package18 s4)
	(at package19 s4)
	(at package20 s3)
	(at package21 s3)
	(at package22 s2)
	(at package23 s2)
	(at package24 s3)
	(at package25 s4)
	(at package26 s3)
	(at package27 s3)
	(at package28 s3)
	(at package29 s2)
	(at package30 s3)
	(at package32 s4)
	(at package33 s1)
	(at package34 s0)
	(at package35 s1)
	(at package36 s4)
	(at package37 s1)
	(at package38 s1)
	(at package39 s1)
	(at package40 s3)
	(at package41 s0)
	))


)

; plan
1. (load-truck s3 package8 truck1)
   deleted: (at package8 s3)
   added: (in package8 truck1)
   goals met: 7 of 49
2. (load-truck s3 package6 truck1)
   deleted: (at package6 s3)
   added: (in package6 truck1)
   goals met: 7 of 49
3. (load-truck s3 package3 truck1)
   deleted: (at package3 s3)
   added: (in package3 truck1)
   goals met: 7 of 49
4. (load-truck s3 package16 truck1)
   deleted: (at package16 s3)
   added: (in package16 truck1)
   goals met: 7 of 49
5. (load-truck s3 package12 truck1)
   deleted: (at package12 s3)
   added: (in package12 truck1)
   goals met: 7 of 49
6. (load-truck s3 package10 truck1)
   deleted: (at package10 s3)
   added: (in package10 truck1)
   goals met: 7 of 49
7. (board-truck driver1 s4 truck5)
   deleted: (at driver1 s4) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 7 of 49
8. (unload-truck s3 package8 truck1)
   deleted: (in package8 truck1)
   added: (at package8 s3)
   goals met: 7 of 49
9. (unload-truck s3 package6 truck1)
   deleted: (in package6 truck1)
   added: (at package6 s3)
   goals met: 7 of 49
10. (unload-truck s3 package3 truck1)
   deleted: (in package3 truck1)
   added: (at package3 s3)
   goals met: 7 of 49
11. (unload-truck s3 package16 truck1)
   deleted: (in package16 truck1)
   added: (at package16 s3)
   goals met: 7 of 49
12. (unload-truck s3 package12 truck1)
   deleted: (in package12 truck1)
   added: (at package12 s3)
   goals met: 7 of 49
13. (unload-truck s3 package10 truck1)
   deleted: (in package10 truck1)
   added: (at package10 s3)
   goals met: 7 of 49
14. (drive-truck driver1 s4 s0 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s0)
   goals met: 7 of 49
15. (load-truck s0 package9 truck5)
   deleted: (at package9 s0)
   added: (in package9 truck5)
   goals met: 7 of 49
16. (load-truck s0 package5 truck5)
   deleted: (at package5 s0)
   added: (in package5 truck5)
   goals met: 7 of 49
17. (load-truck s0 package40 truck5)
   deleted: (at package40 s0)
   added: (in package40 truck5)
   goals met: 7 of 49
18. (load-truck s0 package38 truck5)
   deleted: (at package38 s0)
   added: (in package38 truck5)
   goals met: 7 of 49
19. (load-truck s0 package29 truck5)
   deleted: (at package29 s0)
   added: (in package29 truck5)
   goals met: 7 of 49
20. (load-truck s0 package25 truck5)
   deleted: (at package25 s0)
   added: (in package25 truck5)
   goals met: 7 of 49
21. (drive-truck driver1 s0 s4 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s4)
   goals met: 7 of 49
22. (unload-truck s4 package9 truck5)
   deleted: (in package9 truck5)
   added: (at package9 s4)
   goals met: 8 of 49
23. (load-truck s4 package7 truck5)
   deleted: (at package7 s4)
   added: (in package7 truck5)
   goals met: 8 of 49
24. (drive-truck driver1 s4 s0 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s0)
   goals met: 8 of 49
25. (unload-truck s0 package7 truck5)
   deleted: (in package7 truck5)
   added: (at package7 s0)
   goals met: 9 of 49
26. (load-truck s0 package22 truck5)
   deleted: (at package22 s0)
   added: (in package22 truck5)
   goals met: 9 of 49
27. (drive-truck driver1 s0 s4 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s4)
   goals met: 9 of 49
28. (drive-truck driver1 s4 s2 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s2)
   goals met: 9 of 49
29. (load-truck s2 package41 truck5)
   deleted: (at package41 s2)
   added: (in package41 truck5)
   goals met: 9 of 49
30. (load-truck s2 package4 truck5)
   deleted: (at package4 s2)
   added: (in package4 truck5)
   goals met: 9 of 49
31. (drive-truck driver1 s2 s3 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s3)
   goals met: 9 of 49
32. (load-truck s3 package8 truck5)
   deleted: (at package8 s3)
   added: (in package8 truck5)
   goals met: 9 of 49
33. (drive-truck driver1 s3 s2 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s2)
   goals met: 9 of 49
34. (unload-truck s2 package8 truck5)
   deleted: (in package8 truck5)
   added: (at package8 s2)
   goals met: 10 of 49
35. (drive-truck driver1 s2 s4 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s4)
   goals met: 10 of 49
36. (load-truck s4 package34 truck5)
   deleted: (at package34 s4)
   added: (in package34 truck5)
   goals met: 10 of 49
37. (drive-truck driver1 s4 s0 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s0)
   goals met: 10 of 49
38. (unload-truck s0 package41 truck5)
   deleted: (in package41 truck5)
   added: (at package41 s0)
   goals met: 11 of 49
39. (unload-truck s0 package34 truck5)
   deleted: (in package34 truck5)
   added: (at package34 s0)
   goals met: 12 of 49
40. (load-truck s0 package21 truck5)
   deleted: (at package21 s0)
   added: (in package21 truck5)
   goals met: 12 of 49
41. (drive-truck driver1 s0 s3 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s3)
   goals met: 12 of 49
42. (drive-truck driver1 s3 s2 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s2)
   goals met: 12 of 49
43. (load-truck s2 package39 truck5)
   deleted: (at package39 s2)
   added: (in package39 truck5)
   goals met: 12 of 49
44. (load-truck s2 package35 truck5)
   deleted: (at package35 s2)
   added: (in package35 truck5)
   goals met: 12 of 49
45. (unload-truck s2 package29 truck5)
   deleted: (in package29 truck5)
   added: (at package29 s2)
   goals met: 13 of 49
46. (unload-truck s2 package22 truck5)
   deleted: (in package22 truck5)
   added: (at package22 s2)
   goals met: 14 of 49
47. (drive-truck driver1 s2 s3 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s3)
   goals met: 14 of 49
48. (drive-truck driver1 s3 s0 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s0)
   goals met: 14 of 49
49. (load-truck s0 package20 truck5)
   deleted: (at package20 s0)
   added: (in package20 truck5)
   goals met: 14 of 49
50. (load-truck s0 package18 truck5)
   deleted: (at package18 s0)
   added: (in package18 truck5)
   goals met: 14 of 49
51. (drive-truck driver1 s0 s3 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s3)
   goals met: 14 of 49
52. (load-truck s3 package6 truck5)
   deleted: (at package6 s3)
   added: (in package6 truck5)
   goals met: 14 of 49
53. (drive-truck driver1 s3 s0 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s0)
   goals met: 14 of 49
54. (unload-truck s0 package6 truck5)
   deleted: (in package6 truck5)
   added: (at package6 s0)
   goals met: 15 of 49
55. (load-truck s0 package15 truck5)
   deleted: (at package15 s0)
   added: (in package15 truck5)
   goals met: 15 of 49
56. (drive-truck driver1 s0 s3 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s3)
   goals met: 15 of 49
57. (drive-truck driver1 s3 s2 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s2)
   goals met: 15 of 49
58. (load-truck s2 package1 truck5)
   deleted: (at package1 s2)
   added: (in package1 truck5)
   goals met: 15 of 49
59. (board-truck driver2 s2 truck3)
   deleted: (at driver2 s2) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 15 of 49
60. (drive-truck driver1 s2 s3 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s3)
   goals met: 15 of 49
61. (unload-truck s3 package40 truck5)
   deleted: (in package40 truck5)
   added: (at package40 s3)
   goals met: 16 of 49
62. (drive-truck driver1 s3 s4 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s4)
   goals met: 16 of 49
63. (load-truck s4 package33 truck5)
   deleted: (at package33 s4)
   added: (in package33 truck5)
   goals met: 16 of 49
64. (load-truck s4 package28 truck5)
   deleted: (at package28 s4)
   added: (in package28 truck5)
   goals met: 16 of 49
65. (drive-truck driver1 s4 s3 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s3)
   goals met: 16 of 49
66. (unload-truck s3 package4 truck5)
   deleted: (in package4 truck5)
   added: (at package4 s3)
   goals met: 17 of 49
67. (load-truck s3 package3 truck5)
   deleted: (at package3 s3)
   added: (in package3 truck5)
   goals met: 17 of 49
68. (unload-truck s3 package28 truck5)
   deleted: (in package28 truck5)
   added: (at package28 s3)
   goals met: 18 of 49
69. (drive-truck driver1 s3 s2 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s2)
   goals met: 18 of 49
70. (drive-truck driver1 s2 s1 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s1)
   goals met: 18 of 49
71. (unload-truck s1 package5 truck5)
   deleted: (in package5 truck5)
   added: (at package5 s1)
   goals met: 19 of 49
72. (unload-truck s1 package39 truck5)
   deleted: (in package39 truck5)
   added: (at package39 s1)
   goals met: 20 of 49
73. (drive-truck driver1 s1 s2 truck5)
   deleted: (at truck5 s1)
   added: (at truck5 s2)
   goals met: 20 of 49
74. (drive-truck driver1 s2 s3 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s3)
   goals met: 20 of 49
75. (drive-truck driver1 s3 s4 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s4)
   goals met: 20 of 49
76. (unload-truck s4 package25 truck5)
   deleted: (in package25 truck5)
   added: (at package25 s4)
   goals met: 21 of 49
77. (load-truck s4 package24 truck5)
   deleted: (at package24 s4)
   added: (in package24 truck5)
   goals met: 21 of 49
78. (drive-truck driver1 s4 s3 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s3)
   goals met: 21 of 49
79. (unload-truck s3 package24 truck5)
   deleted: (in package24 truck5)
   added: (at package24 s3)
   goals met: 22 of 49
80. (unload-truck s3 package21 truck5)
   deleted: (in package21 truck5)
   added: (at package21 s3)
   goals met: 23 of 49
81. (unload-truck s3 package20 truck5)
   deleted: (in package20 truck5)
   added: (at package20 s3)
   goals met: 24 of 49
82. (drive-truck driver1 s3 s2 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s2)
   goals met: 24 of 49
83. (drive-truck driver1 s2 s1 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s1)
   goals met: 24 of 49
84. (unload-truck s1 package38 truck5)
   deleted: (in package38 truck5)
   added: (at package38 s1)
   goals met: 25 of 49
85. (unload-truck s1 package35 truck5)
   deleted: (in package35 truck5)
   added: (at package35 s1)
   goals met: 26 of 49
86. (unload-truck s1 package33 truck5)
   deleted: (in package33 truck5)
   added: (at package33 s1)
   goals met: 27 of 49
87. (drive-truck driver1 s1 s2 truck5)
   deleted: (at truck5 s1)
   added: (at truck5 s2)
   goals met: 27 of 49
88. (drive-truck driver1 s2 s3 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s3)
   goals met: 27 of 49
89. (drive-truck driver1 s3 s4 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s4)
   goals met: 27 of 49
90. (unload-truck s4 package18 truck5)
   deleted: (in package18 truck5)
   added: (at package18 s4)
   goals met: 28 of 49
91. (load-truck s4 package13 truck5)
   deleted: (at package13 s4)
   added: (in package13 truck5)
   goals met: 28 of 49
92. (drive-truck driver1 s4 s3 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s3)
   goals met: 28 of 49
93. (load-truck s3 package16 truck5)
   deleted: (at package16 s3)
   added: (in package16 truck5)
   goals met: 28 of 49
94. (unload-truck s3 package15 truck5)
   deleted: (in package15 truck5)
   added: (at package15 s3)
   goals met: 29 of 49
95. (drive-truck driver1 s3 s4 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s4)
   goals met: 29 of 49
96. (load-truck s4 package11 truck5)
   deleted: (at package11 s4)
   added: (in package11 truck5)
   goals met: 29 of 49
97. (drive-truck driver1 s4 s2 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s2)
   goals met: 29 of 49
98. (drive-truck driver1 s2 s1 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s1)
   goals met: 29 of 49
99. (load-truck s1 package30 truck5)
   deleted: (at package30 s1)
   added: (in package30 truck5)
   goals met: 29 of 49
100. (load-truck s1 package27 truck5)
   deleted: (at package27 s1)
   added: (in package27 truck5)
   goals met: 29 of 49
101. (drive-truck driver1 s1 s2 truck5)
   deleted: (at truck5 s1)
   added: (at truck5 s2)
   goals met: 29 of 49
102. (drive-truck driver1 s2 s3 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s3)
   goals met: 29 of 49
103. (unload-truck s3 package30 truck5)
   deleted: (in package30 truck5)
   added: (at package30 s3)
   goals met: 30 of 49
104. (unload-truck s3 package27 truck5)
   deleted: (in package27 truck5)
   added: (at package27 s3)
   goals met: 31 of 49
105. (drive-truck driver1 s3 s2 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s2)
   goals met: 31 of 49
106. (unload-truck s2 package3 truck5)
   deleted: (in package3 truck5)
   added: (at package3 s2)
   goals met: 32 of 49
107. (drive-truck driver1 s2 s1 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s1)
   goals met: 32 of 49
108. (load-truck s1 package23 truck5)
   deleted: (at package23 s1)
   added: (in package23 truck5)
   goals met: 32 of 49
109. (drive-truck driver1 s1 s2 truck5)
   deleted: (at truck5 s1)
   added: (at truck5 s2)
   goals met: 32 of 49
110. (unload-truck s2 package23 truck5)
   deleted: (in package23 truck5)
   added: (at package23 s2)
   goals met: 33 of 49
111. (unload-truck s2 package11 truck5)
   deleted: (in package11 truck5)
   added: (at package11 s2)
   goals met: 34 of 49
112. (drive-truck driver1 s2 s1 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s1)
   goals met: 34 of 49
113. (unload-truck s1 package16 truck5)
   deleted: (in package16 truck5)
   added: (at package16 s1)
   goals met: 35 of 49
114. (load-truck s1 package14 truck5)
   deleted: (at package14 s1)
   added: (in package14 truck5)
   goals met: 35 of 49
115. (drive-truck driver1 s1 s2 truck5)
   deleted: (at truck5 s1)
   added: (at truck5 s2)
   goals met: 35 of 49
116. (drive-truck driver1 s2 s4 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s4)
   goals met: 35 of 49
117. (unload-truck s4 package1 truck5)
   deleted: (in package1 truck5)
   added: (at package1 s4)
   goals met: 36 of 49
118. (board-truck driver6 s2 truck4)
   deleted: (at driver6 s2) (empty truck4)
   added: (driving driver6 truck4)
   goals met: 36 of 49
119. (drive-truck driver2 s2 s3 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s3)
   goals met: 37 of 49
120. (load-truck s3 package12 truck3)
   deleted: (at package12 s3)
   added: (in package12 truck3)
   goals met: 37 of 49
121. (load-truck s3 package10 truck3)
   deleted: (at package10 s3)
   added: (in package10 truck3)
   goals met: 37 of 49
122. (drive-truck driver6 s2 s3 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s3)
   goals met: 38 of 49
123. (disembark-truck driver6 s3 truck4)
   deleted: (driving driver6 truck4)
   added: (at driver6 s3) (empty truck4)
   goals met: 39 of 49
124. (walk driver3 s0 p1-0)
   deleted: (at driver3 s0)
   added: (at driver3 p1-0)
   goals met: 39 of 49
125. (walk driver3 p1-0 s1)
   deleted: (at driver3 p1-0)
   added: (at driver3 s1)
   goals met: 40 of 49
126. (walk driver4 s1 p1-0)
   deleted: (at driver4 s1)
   added: (at driver4 p1-0)
   goals met: 40 of 49
127. (walk driver4 p1-0 s0)
   deleted: (at driver4 p1-0)
   added: (at driver4 s0)
   goals met: 41 of 49
128. (walk driver5 s1 p2-1)
   deleted: (at driver5 s1)
   added: (at driver5 p2-1)
   goals met: 41 of 49
129. (walk driver5 p2-1 s2)
   deleted: (at driver5 p2-1)
   added: (at driver5 s2)
   goals met: 42 of 49
130. (drive-truck driver1 s4 s2 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s2)
   goals met: 42 of 49
131. (unload-truck s2 package14 truck5)
   deleted: (in package14 truck5)
   added: (at package14 s2)
   goals met: 43 of 49
132. (drive-truck driver1 s2 s4 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s4)
   goals met: 43 of 49
133. (drive-truck driver1 s4 s0 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s0)
   goals met: 43 of 49
134. (unload-truck s0 package13 truck5)
   deleted: (in package13 truck5)
   added: (at package13 s0)
   goals met: 44 of 49
135. (drive-truck driver1 s0 s4 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s4)
   goals met: 44 of 49
136. (drive-truck driver1 s4 s2 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s2)
   goals met: 44 of 49
137. (disembark-truck driver1 s2 truck5)
   deleted: (driving driver1 truck5)
   added: (at driver1 s2) (empty truck5)
   goals met: 45 of 49
138. (drive-truck driver2 s3 s4 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s4)
   goals met: 44 of 49
139. (unload-truck s4 package10 truck3)
   deleted: (in package10 truck3)
   added: (at package10 s4)
   goals met: 45 of 49
140. (drive-truck driver2 s4 s3 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s3)
   goals met: 46 of 49
141. (walk driver6 s3 p4-3)
   deleted: (at driver6 s3)
   added: (at driver6 p4-3)
   goals met: 45 of 49
142. (walk driver6 p4-3 s4)
   deleted: (at driver6 p4-3)
   added: (at driver6 s4)
   goals met: 45 of 49
143. (board-truck driver6 s4 truck2)
   deleted: (at driver6 s4) (empty truck2)
   added: (driving driver6 truck2)
   goals met: 45 of 49
144. (drive-truck driver6 s4 s3 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   goals met: 46 of 49
145. (disembark-truck driver6 s3 truck2)
   deleted: (driving driver6 truck2)
   added: (at driver6 s3) (empty truck2)
   goals met: 47 of 49
146. (drive-truck driver2 s3 s2 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s2)
   goals met: 46 of 49
147. (unload-truck s2 package12 truck3)
   deleted: (in package12 truck3)
   added: (at package12 s2)
   goals met: 47 of 49
148. (drive-truck driver2 s2 s3 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s3)
   goals met: 48 of 49
149. (disembark-truck driver2 s3 truck3)
   deleted: (driving driver2 truck3)
   added: (at driver2 s3) (empty truck3)
   goals met: 49 of 49
